In [1]:
import os
os.getcwd()

'C:\\Users\\Admin'

In [4]:
import pandas as pd

orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [15]:
import pandas as pd
import sqlite3
import os

In [16]:
os.listdir()

['.android',
 '.appletviewer',
 '.arduinoIDE',
 '.dotnet',
 '.emulator_console_auth_token',
 '.gradle',
 '.idlerc',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.matplotlib',
 '.node_repl_history',
 '.templateengine',
 '.vscode',
 'Amazon Sale Report.csv',
 'AndroidStudioProjects',
 'AppData',
 'Application Data',
 'Charts.ipynb',
 'circle.py',
 'Cloud Warehouse Compersion Chart.csv',
 'Cookies',
 'data.csv',
 'data.xlsx',
 'database.ipynb',
 'DatabaseConnection.ipynb',
 'Desktop',
 'Documents',
 'Downloads',
 'Ecommerce_Sales_Cleaned_All.csv',
 'Ecommerce_Sales_Cleaned_Final.csv',
 'Expense IIGF.csv',
 'expenses.csv',
 'Favorites',
 'figure_name.png',
 'Inomatics Hackathon',
 'IntelGraphicsProfiles',
 'International sale Report.csv',
 'Links',
 'Local Settings',
 'Marksheet.html',
 'May-2022.csv',
 'miniprojectdv.ipynb',
 'Music',
 'My Documents',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{a2332f18-cdbf-11ec-8680-002248483d79}.TM.blf',
 'NTUSER.DAT{a2332f18-cdbf-11ec-8680-002248483d79}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{a2332f18-cdbf-11ec-8680-002248483d79}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'orders.csv',
 'P  L March 2021.csv',
 'personalexpensetrackerminiproject.ipynb',
 'Pictures',
 'plotlyVSmatplotlib.ipynb',
 'plotly_charts.ipynb',
 'prac6plotly.ipynb',
 'practical3.ipynb',
 'Practicleofcharts.ipynb',
 'PrintHood',
 'py.ipynb',
 'Recent',
 'restaurants.sql',
 'Sale Report.csv',
 'Saved Games',
 'Searches',
 'SendTo',
 'shra.html',
 'Shravani',
 'SKLEARN.ipynb',
 'source',
 'Start Menu',
 'Students.accdb',
 'student_exam_scores.csv',
 'tcp_client.py',
 'tcp_server.py',
 'Templates',
 'udp_client.py',
 'udp_server.py',
 'Untitled.ipynb',
 'untitled.txt',
 'Untitled1.ipynb',
 'Untitled10.ipynb',
 'Untitled11.ipynb',
 'Untitled12.ipynb',
 'Untitled13.ipynb',
 'Untitled14.ipynb',
 'Untitled15.ipynb',
 'Untitled16.ipynb',
 'Untitled17.ipynb',
 'Untitled18.ipynb',
 'Untitled19.ipynb',
 'Untitled2.ipynb',
 'Untitled20.ipynb',
 'Untitled21.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Untitled7.ipynb',
 'Untitled8.ipynb',
 'Untitled9.ipynb',
 'users.json',
 'Videos']

In [13]:
users = pd.read_json("users.json")

print("Users loaded:", users.shape)
users.head()

Users loaded: (3000, 4)

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [17]:
# Create SQLite database in memory
conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

# Execute SQL file
with open("restaurants.sql", "r") as file:
    cursor.executescript(file.read())

# Load restaurants table into DataFrame
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

print("Restaurants loaded:", restaurants.shape)
restaurants.head()

Restaurants loaded: (500, 4)

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [18]:
orders_users = pd.merge(
    orders,
    users,
    how="left",
    on="user_id"
)

print("After merging users:", orders_users.shape)
orders_users.head()

After merging users: (10000, 9)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [19]:
final_df = pd.merge(
    orders_users,
    restaurants,
    how="left",
    on="restaurant_id"
)

print("Final dataset shape:", final_df.shape)
final_df.head()

Final dataset shape: (10000, 12)

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [20]:
print("Orders rows:", orders.shape[0])
print("Final rows :", final_df.shape[0])

Orders rows: 10000
Final rows : 10000

In [22]:
final_df['order_date'] = pd.to_datetime(
    final_df['order_date'],
    format='%d-%m-%Y'
)

In [23]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)
print("final_food_delivery_dataset.csv created successfully")

final_food_delivery_dataset.csv created successfully

In [24]:
gold_city_revenue = (
    final_df[final_df['membership'] == 'Gold']
    .groupby('city')['total_amount']
    .sum()
    .sort_values(ascending=False)
)

gold_city_revenue

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [25]:
final_df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [26]:
user_spend = final_df.groupby('user_id')['total_amount'].sum()

(user_spend > 1000).sum()

np.int64(2544)

In [27]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']

final_df['rating_range'] = pd.cut(final_df['rating'], bins=bins, labels=labels)

final_df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)

C:\Users\Admin\AppData\Local\Temp\ipykernel_4440\4072236018.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
4.1–4.5    1960326.26
3.0–3.5    1881754.57
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [28]:
(
    final_df[final_df['membership'] == 'Gold']
    .groupby('city')['total_amount']
    .mean()
    .sort_values(ascending=False)
)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [29]:
restaurant_count = final_df.groupby('cuisine')['restaurant_id'].nunique()
revenue = final_df.groupby('cuisine')['total_amount'].sum()

summary = pd.DataFrame({
    'restaurants': restaurant_count,
    'revenue': revenue
}).sort_values(['restaurants', 'revenue'], ascending=[True, False])

summary

         restaurants     revenue
cuisine
Chinese          120  1930504.65
Italian          126  2024203.80
Indian           126  1971412.58
Mexican          128  2085503.09

In [30]:
gold_orders = final_df[final_df['membership'] == 'Gold'].shape[0]
total_orders = final_df.shape[0]

round((gold_orders / total_orders) * 100)

50

In [32]:
final_df.groupby(['membership', 'cuisine'])['total_amount'] \
        .sum() \
        .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [33]:
final_df['quarter'] = final_df['order_date'].dt.to_period('Q')

final_df.groupby('quarter')['total_amount'].sum().sort_values(ascending=False)

quarter
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

In [34]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating', 'rating_range', 'quarter'],
      dtype='object')

In [35]:
restaurant_col = 'restaurant_name_x'  # or _y

In [36]:
restaurant_stats = final_df.groupby(restaurant_col).agg(
    avg_order_value=('total_amount', 'mean'),
    order_count=('order_id', 'count')
)

restaurant_stats[
    restaurant_stats['order_count'] < 20
].sort_values('avg_order_value', ascending=False)

                                   avg_order_value  order_count
restaurant_name_x
Hotel Dhaba Multicuisine               1040.222308           13
Sri Mess Punjabi                       1029.180833           12
Ruchi Biryani Punjabi                  1002.140625           16
Sri Delights Pure Veg                   989.467222           18
Classic Kitchen Family Restaurant       973.167895           19
...                                            ...          ...
Annapurna Tiffins Punjabi               621.828947           19
Darbar Tiffins Non-Veg                  596.815556           18
Darbar Restaurant Punjabi               589.972857           14
Spice Tiffins Pure Veg                  578.578667           15
Ruchi Mess Punjabi                      572.686471           17

[170 rows x 2 columns]

In [37]:
gold_orders_count = final_df[final_df['membership'] == 'Gold'].shape[0]
gold_orders_count

4987

In [38]:
hyderabad_revenue = round(final_df[final_df['city'] == 'Hyderabad']['total_amount'].sum())
hyderabad_revenue

1889367

In [39]:
distinct_users = final_df['user_id'].nunique()
distinct_users

2883

In [40]:
gold_avg_order = round(final_df[final_df['membership'] == 'Gold']['total_amount'].mean(), 2)
gold_avg_order

np.float64(797.15)

In [41]:
high_rating_orders = final_df[final_df['rating'] >= 4.5].shape[0]
high_rating_orders

3374

In [42]:
# Step 1: Find top revenue city for Gold members
top_gold_city = final_df[final_df['membership'] == 'Gold'].groupby('city')['total_amount'].sum().idxmax()

# Step 2: Count orders in that city (Gold members only)
top_gold_city_orders = final_df[(final_df['membership'] == 'Gold') & (final_df['city'] == top_gold_city)].shape[0]
top_gold_city, top_gold_city_orders

('Chennai', 1337)